[X2Effect_MecOverheat]
BurningFriendlyName="过热"
BurningFriendlyDesc="过热的装置将无法发挥作用，因为它们会从行动中释放热量。"
BurningEffectAcquiredString="<XGParam:StrValue0/!UnitName/> 过热."
BurningEffectTickedString="<XGParam:StrValue0/!UnitName/> 依旧过热."
BurningEffectLostString="<XGParam:StrValue0/!UnitName/> 不再过热."

[UIPersonnel_MECTraining]
EmptyListMessage="无改造士兵"
MecsUnavailable="无MEC铸造场升级"
NotEnoughResources="没有足够的资源进行改造"
BuildFoundry="建造MEC铸造场"
MeetTechRequirement="MEC技术研究"
MeetStoryRequirement="完成失落之塔/研究机械化战争"


m_strTitle="候选人"
m_strEmptyListLabels[eUIPersonnel_Soldiers]="无改造士兵"

[UIFacility_MecAugmentationSlot]
m_strAugmentSoldierDialogTitle="改造士兵"
m_strAugmentSoldierDialogText="<XGParam:StrValue0/!UnitName/> 可以接受特殊手术成为MEC士兵，取代他们以前的职业并且消耗<XGParam:IntValue0/> 补给和<XGParam:IntValue1/> 超铀核心。该过程一旦开始将不可逆转。你想继续吗？"
m_strNoSoldiersTooltip="无士兵可供MEC改造"
m_strSoldiersAvailableTooltip="MEC 改造"

[UIAlert_MecAugmentationComplete]
m_strAugmentationCompleteLabel="改造完成"

[UIChooseMEC]
m_strTitle=MEC改造专业
m_strInventoryLabel=可用专业:
m_strBuy=开始改造

[X2Effect_RepairProtocol]
HealedMessage="+<Heal/> 生命回复"